Ping/app/controllers/api/sessions_controller.rb

INSERT INTO "users" ("facebook_id", "session_token", "visible_radius", "created_at", "updated_at", "name", "pro_pic_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", nil], ["updated_at", "2017-09-17 01:09:31.444017"], ["id", 5]]
---
  def create
    debugger
    @user = current_user
    if @user
      @user.session_token = params[:session_token]
      @user.save!