Ping/app/controllers/api/users_controller.rb

  def update
    #location
    #automatically track the users location, used by ping in the background
    location = Location.create!(latitude: params[:lat].to_f, longitude: params[:lng].to_f)
    location.save!
    @user = User.find_by_session_token(params[:session_token])
    if @user
      @user.location_id = location.id
      if @user.save
---
INSERT INTO "locations" ("latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["latitude", "37.7765055672"], ["longitude", "-122.4131714143"], ["created_at", "2017-09-17 05:22:51.843766"], ["updated_at", "2017-09-17 05:22:51.843766"]]
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?
UPDATE "users" SET "location_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["location_id", 6], ["updated_at", "2017-09-17 02:47:06.195361"], ["id", 2]]

  def ping
    #first make sure the friend is actually friends with you
    #if the friend is within pingable distance, return the friend's name, pic, and location via JSON, otherwise, return json string "out_of_range"
    #Expects a session_token and a friend fb id
    @user = User.find_by_session_token(params[:session_token])
    @emergency = params[:emergency]
    if @user
      @friend = User.find_by_facebook_id(params[:friend_facebook_id])
      if @friend && @friend.friends.include?(@user)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?
SELECT  "users".* FROM "users" WHERE "users"."facebook_id" = ? LIMIT ?  [["facebook_id", "0"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "friendships" ON "users"."id" = "friendships"."friend_id" WHERE "friendships"."user_id" = ? AND "users"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]

  def get_pings
    #render the json from redis
    #clear redis
    redis = Redis.current
    @user = User.find_by_session_token(params[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2